app/views/admin/pages/index.html.erb

        <label for="layout">Layout</label>
        <%= select_tag :layout, options_for_select([["All layouts", ""]] + Page::LAYOUTS.map { |layout| [layout.titleize, layout] }, @filters[:layout]), class: "cms-select" %>
---
SELECT "pages".* FROM "pages" ORDER BY "pages"."updated_at" DESC