app/views/profiles/edit.html.erb

            <h3>Book Covers</h3>
            <% if @profile.books.any? %>
---
SELECT "books".* FROM "books" WHERE "books"."profile_id" = 1 LIMIT 1