app/views/profiles/show.html.erb

    <% if @profile.books.any? %>
      <% featured_books = @profile.books.select(&:featured?) %>
---
SELECT "books".* FROM "books" WHERE "books"."profile_id" = 1 AND "books"."featured" = 0

        <article class="panel panel-more-books">
          <h2><%= featured_books.any? ? "More Books" : "Books From This Author" %></h2>
---
SELECT 1 AS one FROM "books" WHERE "books"."profile_id" = ? AND "books"."featured" = ? LIMIT ?  [["profile_id", 980190962], ["featured", 0], ["LIMIT", 1]]