app/controllers/admin/pages_controller.rb

SELECT "pages".* FROM "pages" ORDER BY "pages"."updated_at" DESC
---
    def index
      @pages = Page.order(updated_at: :desc)

SELECT 1 AS one FROM "page_blocks" WHERE "page_blocks"."page_id" = 1 LIMIT 1
---
    def edit
      @page.page_blocks.build(kind: "text", position: next_block_position) if @page.page_blocks.empty?

UPDATE "pages" SET "updated_at" = '2026-04-12 04:37:45.543866' WHERE "pages"."id" = 1
---
    def update
      if @page.update(page_params)

SELECT "pages".* FROM "pages" WHERE "pages"."slug" = 'books' LIMIT 1
---
    def set_page
      @page = Page.find_by!(slug: params[:id])

SELECT MAX("page_blocks"."position") FROM "page_blocks" WHERE "page_blocks"."page_id" = 1
---
    def next_block_position
      @page.page_blocks.maximum(:position).to_i + 1