app/controllers/admin/posts_controller.rb

    def index
      @filters = post_filters
      @posts = Post.includes(:post_category, :post_tags).order(updated_at: :desc)
---
SELECT "post_categories".* FROM "post_categories" WHERE "post_categories"."id" IN (?, ?)  [["id", 1069603861], ["id", 500406608]]