app/controllers/admin/posts_controller.rb

    def index
      @posts = Post.order(updated_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."updated_at" DESC

    def create
      @post = Post.new(post_params)

      if @post.save
---
INSERT INTO "posts" ("title", "slug", "status", "excerpt", "published_at", "created_at", "updated_at") VALUES ('The Books of a Lifetime', 'the-books-of-a-lifetime', 1, 'Books will change your life', '2026-04-12 01:07:00', '2026-04-12 05:09:10.719918', '2026-04-12 05:09:10.719918') RETURNING "id"

    def update
      if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = '2026-04-12 05:09:10.888730' WHERE "posts"."id" = 1

    def set_post
      @post = Post.find_by!(slug: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'the-books-of-a-lifetime' LIMIT 1