app/controllers/admin/sales_controller.rb

    def index
      @members = User.where(admin: false).includes(:profile, :pay_customers).order(created_at: :desc)
      @total_signups = @members.count
      @paid_members = @members.select(&:paid_member?).count
      @free_members = @total_signups - @paid_members
      @total_revenue_cents = Pay::Charge.where("amount > 0").sum(:amount)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" IN (6, 5, 4, 3, 2)
SELECT "users".* FROM "users" WHERE "users"."admin" = 0 ORDER BY "users"."created_at" DESC
SELECT COUNT(*) FROM "users" WHERE "users"."admin" = 0
SELECT SUM("pay_charges"."amount") FROM "pay_charges" WHERE (amount > 0)

    def set_member
      @member = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]