app/controllers/admin/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "admin", "first_name", "last_name") VALUES ('support@authoshout.com', '$2a$12$iN31xWQ9e7Dp7HZMYc4ZZugZZ/j11xUngZZCeHT0TdbWYlpivlFAS', NULL, NULL, NULL, '2026-04-27 01:27:18.534452', '2026-04-27 01:27:18.534452', 0, NULL, NULL) RETURNING "id"
---
    def create
      generated_password = SecureRandom.base58(12)
      @new_member = User.new(
        email: user_params[:email],
        password: generated_password,
        password_confirmation: generated_password,
        human_verification: "1"
      )

      if @new_member.save

SELECT "users".* FROM "users" WHERE "users"."admin" = 1 ORDER BY "users"."created_at" ASC
---
    def load_users
      users = User.order(created_at: :asc)
      search = params[:q].to_s.strip.downcase

      if search.present?
        pattern = "%#{search}%"
        users = users.where(
          "LOWER(email) LIKE :pattern OR LOWER(first_name) LIKE :pattern OR LOWER(last_name) LIKE :pattern",
          pattern: pattern
        )
      end

      @query = params[:q].to_s.strip
      @admins = users.where(admin: true)