app/views/admin/dashboard/index.html.erb

          <li>
            <% if book.profile.present? %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 3 LIMIT 1