app/views/pages/show.html.erb

SELECT 1 AS one FROM "page_blocks" WHERE "page_blocks"."page_id" = ? LIMIT ?  [["page_id", 980190963], ["LIMIT", 1]]
---
    </article>
  <% elsif @page.page_blocks.any? %>