app/views/admin/posts/_form.html.erb

SELECT "post_categories".* FROM "post_categories" ORDER BY "post_categories"."name" ASC
---
      <%= f.label :post_category_id, "Category" %>
      <%= f.select :post_category_id, options_from_collection_for_select(@post_categories, :id, :name, post.post_category_id), { include_blank: "No category" }, class: "cms-select" %>