app/views/admin/posts/index.html.erb

            <td><%= post.post_category&.name || "Uncategorized" %></td>
            <td><%= post.post_tags.any? ? post.post_tags.map(&:name).join(", ") : "No tags" %></td>
---
SELECT "post_tags".* FROM "post_tags" ORDER BY "post_tags"."name" ASC
SELECT "posts".* FROM "posts" ORDER BY "posts"."updated_at" DESC