app/views/admin/posts/show.html.erb

SELECT 1 AS one FROM "post_tags" INNER JOIN "post_taggings" ON "post_tags"."id" = "post_taggings"."post_tag_id" WHERE "post_taggings"."post_id" = 1 LIMIT 1
---
    <p><strong>Category:</strong> <%= @post.post_category&.name || "Uncategorized" %></p>
    <p><strong>Tags:</strong> <%= @post.post_tags.any? ? @post.post_tags.map(&:name).join(", ") : "No tags" %></p>