app/controllers/book_likes_controller.rb

  def create
    like = if user_signed_in?
      @book.book_likes.new(user: current_user)
    else
      @book.book_likes.new(visitor_token: current_visitor_token)
    end

    if like.save
---
INSERT INTO "book_likes" ("book_id", "user_id", "visitor_token", "created_at", "updated_at") VALUES (1, 1, NULL, '2026-04-12 00:46:33.422281', '2026-04-12 00:46:33.422281') RETURNING "id"

  def set_book
    @book = Book.find(params[:book_id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1