app/controllers/home_controller.rb

SELECT "book_likes".* FROM "book_likes" WHERE "book_likes"."book_id" IN (5, 3)
SELECT "books".* FROM "books" WHERE "books"."featured" = 1 ORDER BY "books"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 5)
SELECT COUNT(*) FROM "books"
SELECT "books".* FROM "books" ORDER BY "books"."featured" DESC, "books"."created_at" DESC LIMIT 8 OFFSET 0
SELECT "pages".* FROM "pages" ORDER BY "pages"."updated_at" DESC LIMIT 5
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT 10
SELECT COUNT(*) FROM "pages"
---
  def index
    books_scope = Book.includes(:book_likes, profile: :user).with_attached_cover_image.order(featured: :desc, created_at: :desc)

    @per_page = 8
    @total_books = books_scope.count
    @total_pages = [ (@total_books.to_f / @per_page).ceil, 1 ].max
    @page = params[:page].to_i
    @page = 1 if @page < 1
    @page = @total_pages if @page > @total_pages

    @books = books_scope.offset((@page - 1) * @per_page).limit(@per_page)