app/controllers/home_controller.rb

  def index
    all_books_scope = Book.includes(:book_likes, profile: :user).with_attached_cover_image
    featured_candidates = all_books_scope.where(featured: true).order(created_at: :desc).to_a
    @featured_books = featured_candidates.select { |book| book.user.paid_member? || book.user.featured_author? }
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3