app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles"
---
  def update
    @profile = current_user.profile

    if @profile.update(profile_params)
      redirect_to profile_path(@profile), notice: "Profile saved successfully."
    else
      @profile.books.build if @profile.books.blank?

SELECT "books".* FROM "books" WHERE "books"."profile_id" = 1 AND "books"."featured" = 0
---
    scope = Profile.includes(:user, books: :book_likes).merge(Book.order(featured: :desc, created_at: :asc))

SELECT "books".* FROM "books" WHERE "books"."profile_id" = 1
---
  def set_plan_state
    @book_limit = current_user.book_limit
    @book_limit_reached = @book_limit.present? && @profile.books.reject(&:marked_for_destruction?).size >= @book_limit