app/controllers/profiles_controller.rb

SELECT 1 AS one FROM "books" WHERE "books"."profile_id" = 1 AND "books"."featured" = 0 LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 1 LIMIT 1
SELECT "books".* FROM "books" WHERE "books"."profile_id" = 1 AND "books"."featured" = 1
---
  def edit
    @profile = current_user.profile
    # Ensure featured book exists
    if @profile.books.where(featured: true).blank?

UPDATE "profiles" SET "bio" = '', "website" = '', "x_url" = '', "facebook_url" = '', "instagram_url" = '', "threads_url" = '', "bluesky_url" = '', "youtube_url" = '', "updated_at" = '2026-04-12 00:44:20.174570', "avatar_url" = 'https://m.media-amazon.com/images/S/amzn-author-media-prod/84a7c7maaauhipos0k089cvrri._SY600_._SL200_._PQ50_._FMwebp_.jpg' WHERE "profiles"."id" = 1
UPDATE "users" SET "updated_at" = '2026-04-12 01:41:25.133817', "first_name" = 'Terry', "last_name" = 'Thompson' WHERE "users"."id" = 2
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 1 LIMIT 1
SELECT "books".* FROM "books" WHERE "books"."profile_id" = 1
---
  def update
    @profile = current_user.profile

    if @profile.update(profile_params)
      redirect_to profile_path(@profile), notice: "Profile saved successfully."
    else
      # Ensure featured book exists for re-render
      if @profile.books.where(featured: true).blank?

SELECT "book_likes".* FROM "book_likes" WHERE "book_likes"."book_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1
SELECT DISTINCT "profiles"."id" FROM "profiles" INNER JOIN "users" ON "users"."id" = "profiles"."user_id" LEFT OUTER JOIN "books" ON "books"."profile_id" = "profiles"."id" LEFT OUTER JOIN "book_likes" ON "book_likes"."book_id" = "books"."id" WHERE (LOWER(REPLACE(COALESCE(users.first_name, '') || '-' || COALESCE(users.last_name, ''), ' ', '-')) = 'admin-user') LIMIT 1
---
  def set_profile
    @profile = Profile.includes(:user, books: :book_likes).find(params[:id])