app/controllers/profiles_controller.rb

    scope = Profile.includes(:user, books: :book_likes)
---
SELECT "profiles".* FROM "profiles"
SELECT "book_likes".* FROM "book_likes" WHERE "book_likes"."book_id" = 2