app/models/book.rb

SELECT 1 AS one FROM "book_likes" WHERE "book_likes"."book_id" = 1 AND "book_likes"."user_id" = 1 LIMIT 1
---
  def liked_by?(user: nil, visitor_token: nil)
    if user.present?
      return book_likes.any? { |like| like.user_id == user.id } if association(:book_likes).loaded?