app/models/book_like.rb

  def increment_book_likes_count
    book.increment!(:likes_count)
---
UPDATE "books" SET "likes_count" = COALESCE("likes_count", 0) + 1 WHERE "books"."id" = 1